{
  "number": 12,
  "introduction": "Hi and welcome to the 12th iteration of Tipsrundan! For today we got everything from 'Programmer Dad Jokes' to a universal file-opening tool in Python which will simplify your life!",
  "godisboxen": [
    {
      "category": "BACKEND",
      "title": "Smart Open (Python)",
      "link": "https://github.com/RaRe-Technologies/smart_open",
      "description": "Have you ever dreamt of opening a file independent of its type with the same method? Without thinking? I have, and I bet some of you have! I discovered this library when I was working on something using gensim (will be in another Tipsrundan) and I was amazed. RaRe-Technologies has created a pythonic interface where they override 'open' using their own and instead lets you open gzip, bz, s3 storage, normal files - you name it. You can open it as a remote data is locally and you stream it line by line, you can open a zipped file like it wasn't zipped. It's pretty much amazing! Check it out if you ever use Python (or get interested to port this to another language, that'd be cool)!"
    },
    {
      "category": "BACKEND",
      "title": "Why We Started Putting Unpopular Assets in Memory",
      "description": "This makes no sense coming from the title, it almost makes no sense at the end of the article. But it's very interesting and you get to learn things about how SSDs works and why this approach actually help Cloudflare saving costs. As I said, it barely makes sense but it does, a cool read!",
      "link": "https://blog.cloudflare.com/why-we-started-putting-unpopular-assets-in-memory/"
    },
    {
      "category": "TESTING",
      "title": "Gatling & SW Test Academy",
      "description": "Gatling is used for web and API performance testing. It's Open Source  and looks beautiful, make sure to check it out! Here's a free tutorial on how to get started!",
      "link" : "https://www.swtestacademy.com/category/performance-testing/gatling/"
    },
    {
      "category": "TESTING",
      "title": "A complete guide to Web Application Testing",
      "description": "This guide is not only good to learn how (and why) to test Web Applications but can serve well as a lookup when in doubt! Make sure to take a quick peek, or a deep read.",
      "link" : "https://www.softwaretestinghelp.com/web-application-testing/"
    },
    {
      "category": "SOFTVALUES",
      "title": "Tips för effektiva möten och workshops online, del 1 - mötesuppstart",
      "description": "Our own Chris Hofstetter has composed his own best advice on how to be effective during CoViD-19. The first edition is about starting up meetings and is found on the Konstultbolag1 blogg.",
      "link": "https://konsultbolag1.se/bloggen/tips-for-effektiva-moten-och-workshops-online-del-1-motesuppstart"
    },
    {
      "title": "The Webpage - The news paper on the web",
      "description": "Have you ever thought that it'd be cool to read news from the internet like they where from a newspaper? Russellsaw got you covered! This is an incredibly cool concept that the author created to scratch his itch from an idea he got one night. Check it out! Who knows, perhaps it'll be your new newspaper? ;)",
      "link": "https://news.russellsaw.io"
    },
    {
      "title": "Quarantine Life Feels Dull? Get a daily ProgrammerDadJoke!",
      "description": "Even if you might not actually make it send you a daily joke the subreddit is hilarious!",
      "link": "https://github.com/InconceivableDuck/joke-sender"
    }
  ]
}