{
  "number": 33,
  "introduction": "Happy Tipsrundan!  \nTipsrundan today hopefully has something for everyone by including everything from simple MVPs (streamlit) to cash flow gambling to compression benchmarks. And of course a final push for free certificates from Microsft ;)",
  "supertips": {
    "title": "Stop turning your computer off & on again by turning your graphics drivers off & on again!",
    "description": "From the previous Tipsrundan with Clipboard History, _Eric Lindeberg_ has another tool he's used for years achieving the same behaviour. Make sure to check out [CLCL](https://www.nakka.com/soft/clcl/index_eng.html) which Eric has enjoyed for a long time!\n\n---\n\nExperienced a complete computer-freeze? You might hear Roys (IT Crowd) voice telling you \"have you tried turning it off and on again?\".   \nWell, it turns out you might not even need to restart the computer but simply the graphic drivers - and that's pretty simple.\n\n**Windows:** `CTRL+SH+WIN+B`  \n**Mac:** Change your resolution, this can easily be on a hotkey if you use [QuickRes](https://thnkdev.com/QuickRes/)\n**Linux (gnome):** `ALT+F2` and enter the command `r` in the Command box."
  },
  "godisboxen": [
    {
      "title": "Streamlit - A recommendation",
      "description": "Dennis Londögård read into _streamlit_ and was very impressed by the ease of use and how backend + frontend is unified through simple scripting. Streamlit also allows you to achieve great caching through incredibly simple tools.",
      "category": "BACKEND",
      "link": "https://afry-south.github.io/backend/frontend/machine-learning/streamlit/"
    },
    {
      "title": "FREE Microsoft Certifications",
      "description": "<img src=\"https://i.imgflip.com/569l09.jpg\" alt=\"badge\" width=\"30%\"/>\nAFRY is a Microsoft Partner and have free certifications at Microsoft until the **last of June**.   \nAI? Azure Pipelines? DevOps? Cloud Databases? Security? Microsft/Azure has something interesting for most out there.\n\nSo take this chance and **reach out to your manager about taking a certification**, it's the final \"push\" now! \n\n<img src=\"https://docs.microsoft.com/en-us/media/learn/certification/badges/microsoft-certified-associate-badge.svg\" alt=\"badge\" width=\"5%\"/>",
      "category": "REGIONAL",
      "afry": true,
      "link": "https://docs.microsoft.com/sv-se/learn/certifications/"
    },
    {
      "title": "Buffer Allocations that hurts your soul in secret ways",
      "description": "Every single program allocates memory. Byte buffers are at the core of many essential libraries which power the services the modern internet is built upon. If you’re building such a library, or even just copying data between different files, chances are you’ll need to allocate a buffer.\n\nIn this post you'll learn the difference between `allocate` and `allocateDirect`. Both exists by a reason (on the JVM) and have some pretty interesting properties.\n\n<img src=\"https://serce.me/img/allocatedirect/itsgone.png\" alt=\"badge\" width=\"30%\"/>\n\n>Yeah well, sometimes the things we do don’t matter right now. Sometimes they matter later. We have to care more about later sometimes, you know.",
      "category": "RANDOM",
      "link": "https://serce.me/posts/18-11-2020-allocate-direct/"
    },
    {
      "title": "Compress much?",
      "description": "Wondering why your compression sucks? Want to learn what trade-offs that needs to be done depending on your requirements? Tuning for read? Write? Or even compression-ratio?  \nThe _quixdb_ \"sqash compression benchmark\" has you covered and also benchmarks multiple modes for the compression algorithms. P.S. `zstd` is currently my favourite, fight me over it!",
      "category": "RANDOM",
      "link": "https://quixdb.github.io/squash-benchmark/#results"
    },
    {
      "title": "Boston Dynamics builds an actual robot",
      "description": "I know most of you've been digging what Boston Dynamics has put out this far, from dogs to other things. But this time they might actually need some cash because they built something useful rather than impressing.   \nThe Verge goes through their new \"Warehouse Logistics Stretch Robot\".",
      "category": "RANDOM",
      "link": "https://www.theverge.com/2021/3/29/22349978/boston-dynamics-stretch-robot-warehouse-logistics"
    },
    {
      "title": "Have you ever thought about winning financially by loosing financially?",
      "description": "This blog goes to depth on why it might make sense to actually play around with a cash flow and not win anything to later take it all. It's very detailed and lays out the thought process in a way that makes sense. I think I can say what he said took him years he solved in minutes for me, but perhaps I'll realise in a year I was wrong.",
      "category": "RANDOM",
      "link": "https://commoncog.com/blog/cash-flow-games/"
    }
  ]
}