{
    "number": 29,
    "introduction": "Today we got a minor rebranding. The focus from now on will shift into two parts; SuperTipset & Godisboxen where the first is one practical tip and the candy box is the normal articles, videos & more. If this is appreciated I'd love to hear some feedback!",
    "regional": [
        {
            "title": "Competence: Algorithms",
            "description": "Are you excited to improve your algorithmic skills in a competitive environment? Make sure to join in on the Algorithm Competence Evening the 3rd of March. Reach out on Slack or to Linus.Roman@afry.com for an invite!"
        },
        {
            "title": "Competence: Deep Learning",
            "description": "Transformers & Self Attention - how do they work? Learn exactly how they work by implementing your own Self Attention & Transformer bottom up! Join in the 24th of February (this Wednesday) by pinging on Slack or Hampus.Londogard@afry.com for an invite!"
        }
    ],
    "videosAndPodcasts": [],
    "conferenceAndLearning": [
        
    ],
    "frontendAndMobile": [],
    "backendAndBigData": [
       
    ],
    "testing": [],
    "machineLearning": [
        
    ],
    "softValues": [
    ],
    "random": [
        {
            "title": "Library of Scroll - Hand Curated Articles",
            "description":"Do you ever feel like the internet is too large to even start reading all the superb content? Or even find it? Library of Scroll shares three articles per week that are hand-curated and most of the time really interesting!",
            "link":"https://libraryofscroll.com/"
        },
        {
            "title": "bat - a cat clone with wings",
            "description":"Have you ever wished for cat to highlight the syntax of your code file? You got it! And for those that hang around the interwebz - yes, it's written in Rust.",
            "link":"https://github.com/sharkdp/bat"
        },
        {
            "title": "O&O ShutUp10: Free antispy tool for Windows 10",
            "description":"Turn on & off Windows features through a incredibly easy GUI, which also makes it clear how it impacts your day-to-day Windows life.",
            "link":"https://www.oo-software.com/en/shutup10"
        },
        {
            "title": "A 'safe' GUI for your Xiaomi Roborock Vacuumcleaner",
            "description":"Valetudo is a standalone binary which runs on rooted Vacuums of the Xiaomi ecosystem and aims to enable the user to operate the robot vacuum without any Cloud Connection whatsoever.",
            "link":"https://valetudo.cloud/"
        }
    ]
  }