{
  "number": 39,
  "introduction": "This is the first (small) Tipsrundan post-vacay! I hope everyone had an awesome summer and got to enjoy some time in the sun (or a basement hitting those keystrokes! 😉). Let's dive in! 🤿",
  "supertips": {
    "title": "exercism - practice code or mentoring anyone!",
    "description": "Björn Pedersen warmly recommends you to sign up for [exercism.io](https://exercism.io/) and either practice your coding or reviewing someone else. He do (or don't) promise you'll have a great time and learn a thing or two!\n\nP.S. it's also great to learn a new language this way!"
  },
  "godisboxen": [
    {
      "title": "Litements - SQLite extensions that makes sense",
      "description": "Some of us use SQLite extensively, and those who don't might just miss out on something.\n\nLitements is components built on top of SQLite which includes:\n - a [queue](https://litements.exampl.io/queue/) that allows you to create a persistent queue\n - [dictionary](https://litements.exampl.io/dictionary/) that allows you to have a persisten key-value store\n - [counter](https://litements.exampl.io/counter/) which gives you a persistent counter",
      "link": "https://litements.exampl.io/",
      "category": "BACKEND"
    },
    {
      "title": "Text Classification through Data Compression 🤪",
      "description": "A few of us know that Language Models used for Text in AI/ML is a way to compress knowledge.\n  A few more of us knows that Data Compression that's great knows a bit about the statistical distribution of the data to compress it more efficiently.\n\n💡 What if we used _compression_ as a language model? The [LZW algorithm](https://www.wikiwand.com/en/Lempel%E2%80%93Ziv%E2%80%93Welch) actually models a maximum-entropy probability distribution. Read the following blog to learn exactly how it's done!",
      "link": "https://maxhalford.github.io/blog/text-classification-by-compression/",
      "category": "MACHINELEARNING"
    },
    {
      "title": "The small web is beautiful",
      "description": "A good, well-written blog.\n\n>I believe that small websites are compelling aesthetically, but are also important to help us resist selling our souls to large tech companies. In this essay I present a vision for the “small web” as well as the small software and architectures that power it. Also, a bonus rant about microservices.",
      "link": "https://benhoyt.com/writings/the-small-web-is-beautiful/",
      "category": "RANDOM"
    }
  ]
}