{
  "number": 54,
  "introduction": "Time is flying and we're back at Tipsrundan time!",
  "godisboxen": [
    {
      "title": "The Apple GPU and the impossible bug The Apple GPU and the impossible bug",
      "description": "Rosenzweig is brilliant! Do you enjoy fun debugging? Join in on Rosenzweigs journey. You'll learn more about GPU:s and rendering including shaders and everything. :)",
      "category": "RANDOM",
      "link": "https://rosenzweig.io/blog/asahi-gpu-part-5.html"
    },
    {
      "title": "Using Java's Project Loom to build more reliable distributed systems",
      "description": "Personally Project Loom is incredibly exciting. Green threads without changing your code? Count me in!\n\nHere's a interesting blog about a usecase of Project Loom to test distributed Databases in a more efficient manner. It's pretty technical, so be ready! ",
      "category": "BACKEND",
      "link": "https://jbaker.io/2022/05/09/project-loom-for-distributed-systems/"
    },
    {
      "title": "How I fell in love with low-js",
      "description": "Every day I feel like more and more the pendulum is swinging towards Server Side Rendering again, not only because of simplicity but also because of efficiency. A Server Side Rendered app is much better as long as we don't require interaction on the client (e.g. Google Slides, Figma and others). A lot of apps today are built as Backend + SPA even if it's not required, slower and buggier. Reducing glue code and having less states (Server Side Rendering) can only be positive! Or can it? What is your take?",
      "category": "FRONTEND",
      "link": "https://edofic.com/posts/2022-01-28-low-js/"
    },
    {
      "title": "Choose Boring Technology",
      "description": "Given the previous post I think this is a given contender - Boringtechnology is a classic which I think everyone should view and think about. If you enjoy these types of thought experiments / ideas, then make sure to join #learn-bokcirkel_south which discuss things like this weekly!",
      "category": "RANDOM",
      "link": "https://boringtechnology.club/"
    },
    {
      "title": "Patterns in confusing explanations",
      "description": "Simply brilliant. \n\n>Hello! Recently I’ve been thinking about why I explain things the way I do. The usual way I write is:\n\n>Try to learn a topic\nRead a bunch of explanations that I find confusing\nEventually understand the topic\nWrite an explanation that makes sense to me, to help others\nSo why do I find all these explanations so confusing? I decided to try and find out! I came up with a list of 13 patterns that make explanations hard for me to understand. For each pattern I’ll also explain what I like to do instead to avoid the issue.",
      "category": "RANDOM",
      "link": "https://jvns.ca/blog/confusing-explanations"
    }
  ]
}